-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Мар 20 2024 г., 20:29
-- Версия сервера: 10.4.12-MariaDB
-- Версия PHP: 7.4.5

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `star`
--

-- --------------------------------------------------------

--
-- Структура таблицы `blessings`
--

CREATE TABLE `blessings` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `img` varchar(255) NOT NULL,
  `descrip` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `blessings`
--

INSERT INTO `blessings` (`id`, `name`, `img`, `descrip`) VALUES
(1, 'Почему всё ещё не исчезло?', 'благо.png', 'Lv 1 - В начале хода противника периодический урон активируется 1 раз, в результате чего противник получает урон, равный 90% от текущего наложенного периодического урона.<br><br>\r\nLv 2 - В начале хода противника периодический урон активируется 1 раз, в результате чего противник получает урон, равный 135% от текущего наложенного периодического урона.'),
(2, 'Человек в футляре', 'благо.png', 'Lv 1 - Каждый раз, когда противник получает статус с эффектом периодического урона, он также получает 3 ур. Подозрения.<br><br>\r\nLv 2 - Каждый раз, когда противник получает статус с эффектом периодического урона, он также получает 3 ур. Подозрения. Каждый раз, когда таймер периодического урона обновляется, накладывается 1 ур. Подозрения.<br><br>\r\nПодозрение - Ослабление, вызванное определёнными благословениями Небытия.\r\nКаждый уровень повышает получаемый периодический урон на 1%. Этот эффект может складываться до 99 раз, но в конце хода теряет 2 ур.');

-- --------------------------------------------------------

--
-- Структура таблицы `characters`
--

CREATE TABLE `characters` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `rare` int(11) NOT NULL,
  `img` varchar(255) NOT NULL,
  `element_id` int(11) NOT NULL,
  `path` varchar(255) NOT NULL,
  `img_path` varchar(255) NOT NULL,
  `img_list` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `characters`
--

INSERT INTO `characters` (`id`, `name`, `rare`, `img`, `element_id`, `path`, `img_path`, `img_list`) VALUES
(1, 'Цзинлю', 5, 'Цзинлю.png', 2, 'Разрушение', 'Разрушение.png', 'Цзинлю_список.png'),
(2, 'Топаз и Счетовод', 5, 'Топаз.png', 3, 'Охота', 'Охота.png', 'Топаз_список.png'),
(3, 'Гуйнайфэнь', 4, 'Гуйнайфэнь.png', 3, 'Небытие', 'Небытие.png', 'гуйнайфэнь_список.png');

-- --------------------------------------------------------

--
-- Структура таблицы `char_desc`
--

CREATE TABLE `char_desc` (
  `id_char_desc` int(11) NOT NULL,
  `hystory` text NOT NULL,
  `trace_ability1` text NOT NULL,
  `trace_ability1_img` varchar(255) NOT NULL,
  `trace_ability2` text NOT NULL,
  `trace_ability2_img` varchar(255) NOT NULL,
  `trace_ability3` text NOT NULL,
  `trace_ability3_img` varchar(255) NOT NULL,
  `basic_atk` text NOT NULL,
  `basic_atk_img` varchar(255) NOT NULL,
  `skill` text NOT NULL,
  `skill_img` varchar(255) NOT NULL,
  `ult` text NOT NULL,
  `ult_img` varchar(255) NOT NULL,
  `talant` text NOT NULL,
  `talant_img` varchar(255) NOT NULL,
  `tech` text NOT NULL,
  `tech_img` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `char_desc`
--

INSERT INTO `char_desc` (`id_char_desc`, `hystory`, `trace_ability1`, `trace_ability1_img`, `trace_ability2`, `trace_ability2_img`, `trace_ability3`, `trace_ability3_img`, `basic_atk`, `basic_atk_img`, `skill`, `skill_img`, `ult`, `ult_img`, `talant`, `talant_img`, `tech`, `tech_img`) VALUES
(1, 'Некогда Мастер меча на Лофу, прославившая непобедимость Облачных Рыцарей. Но теперь её имя забыто, она стала предательницей Сяньчжоу, поражённой Марой.', '<h3>A2 - Адское место</h3>\n<p>Статус Спектральная трансмиграция повышает сопротивление эффектам персонажа на <font color=\"gold\">35%.</font></p>', 'цзинлю trace ability1.png', '<h3>A4 - Мастер меча</h3>\n<p>После использования умения Непостижимая Зарница следующее действие персонажа продвигается вперёд на <font color=\"gold\">10%</font>.</p>', 'цзинлю trace ability2.png', '<h3>A6 - Морозный призрак</h3>\n<p>Статус Спектральная трансмиграция повышает наносимый сверхспособностью урон на <font color=\"gold\">20%</font>.</p>', 'цзинлю trace ability3.png', '<h3>Лунное сияние</h3>\n<p>Наносит выбранному противнику ледяной урон, равный <font color=\"gold\">90%(5ур) / 100%(6ур) / 130%(9ур)</font> от силы атаки Цзинлю.</p>', 'цзинлю basic atk.png', '<h3>Непостижимая Зарница<h3>\n<p>Наносит выбранному противнику ледяной урон, равный <font color=\"gold\">175%(8ур) / 200%(10ур) / 250%(15ур)</font> от силы атаки Цзинлю, и получает 1 ур. статуса Сизигия.</p>\n<h3>Луна на застывшей реке</h3><p>...</p>', 'цзинлю skill.png', '<h3>Стремительные цветы, мимолётные звёздные сны</h3>\n<p>Наносит выбранному противнику ледяной урон, равный <font color=\"gold\">270%(8ур) / 300%(10ур) / 360%(15ур)</font> от силы атаки Цзинлю, и наносит соседним целям ледяной урон, равный <font color=\"gold\">135%(8ур) / 150%(10ур) / 180%(15ур)</font> от её силы атаки. После окончания атаки получает 1 ур. статуса Сизигия.</p>', 'цзинлю ult.png', '<h3>Трансмиграция полумесяца</h3>\r\n<p>Когда Цзинлю имеет 2 ур. статуса Сизигия, она входит в состояние Спектральная трансмиграция, которое продвигает действие персонажа вперёд на 100%, повышает крит. шанс на <font color=\"gold\">47.5%(8ур) / 50%(10ур) / 55%(15ур)</font>, а затем усиливает навык Непостижимая Зарница до навыка <font color=\"white\">Луна на застывшей реке</font>, и персонаж может использовать только его. Во время атаки в состоянии Спектральная трансмиграция Цзинлю поглощает HP всех союзников, которое равно 4% от их макс. здоровья (здоровье каждого союзника не может быть опущено ниже 1 ед.) Сила атаки Цзинлю повышается на 540% от поглощённого здоровья всех союзников. Её повышение силы атаки имеет верхний предел, который равен <font color=\"gold\">157.5%(8ур) / 180%(10ур) / 225%(15ур)</font> от её базовой силы атаки, и длится до конца текущей атаки. До окончания состояния Спектральная трансмиграция нельзя войти в это состояние повторно. Статус Спектральная трансмиграция может складываться до макс. 3 ур. Когда уровни статуса Сизигия опускаются до 0, Цзинлю теряет статус Спектральная трансмиграция.</p>', 'цзинлю talant.png', '<h3>Сокровенная природа</h3>\n<p>Использование техники создаёт вокруг персонажа пространство на 20 сек. Противники в этом пространстве получают статус Заморозка. В начале боя с противником в пространстве персонаж восстанавливает 15 ед. своей энергии и получает 1 ур. статуса Сизигия и базовый шанс 100% наложить на противников статус Заморозка на 1 ход(а). Противник со статусом Заморозка не может совершать действий и будет получать дополнительный ледяной урон, равный 80% от силы атаки Цзинлю, в начале каждого хода. Одновременно может существовать только одно пространство, созданное союзниками.</p>', 'цзинлю tech.png'),
(2, 'Старший сотрудник отдела стратегических инвестиций Корпорации межзвёздного мира Топаз, возглавляет группу по аудиту особых долгов. Ещё в юности присоединилась к Десяти каменным сердцам, её краеугольный камень - топаз возврата долгов. Её верная свинка-копилка по имени Счетовод обладает особым нюхом на богатства, что обеспечивает безопасность и точность расчётов, а ещё облегчает взыскание долгов. Вместе они путешествуют по просторам бескрайней вселенной и решают всевозможные долговые споры, влияющие на деловые операции Корпорации.', '<h3>A2 - Перерасход</h3>\r\n<p>Когда базовая атака Топаз наносит урон, она считается бонус-атакой.</p>', 'топаз trace ability1.png', '<h3>A4 - Финансовое потрясение</h3>\r\n<p>Урон Топаз и Счетовода, наносимый противникам с огненной уязвимостью, повышается на <font color=\"gold\">15%</font>.</p>', 'топаз trace ability2.png', '<h3>A6 - Техническое регулирование</h3>\r\n<p>Когда Счетовод атакует в состоянии Поразительный рост!, Топаз дополнительно восстанавливает <font color=\"gold\">10 ед.</font> энергии.</p>', 'топаз trace ability3.png', '<h3>Дефицит...</h3>\r\n<p>Наносит выбранному противнику огненный урон, равный <font color=\"gold\">90%(5ур) / 100%(6ур) / 130%(9ур)</font> от силы атаки Топаз.</p>', 'топаз basic atk.png', '<h3>Трудности с оплатой?</h3>\r\n<p>Накладывает на выбранного противника статус Справка о задолженности, который повышает получаемый урон от бонус-атак на <font color=\"gold\">43.75%(8ур) / 50%(10ур) / 62.5%(15ур)</font>. Статус Справка о задолженности применяется только к последней цели, получившей этот статус. В начале хода или во время действия союзника, если на поле боя нет противника со статусом Справка о задолженности, то Топаз накладывает этот статус на случайного противника.\r\nСчетовод наносит этой цели огненный урон, равный <font color=\"gold\">131.25%(8ур) / 150%(10ур) / 187.5%(15ур)</font> от силы атаки Топаз. Когда использование этого навыка наносит урон, оно считается проведением бонус-атаки.</p>', 'топаз skill.png', '<h3>Из убытка в прибыль!</h3>\r\n<p>Счетовод входит в состояние Поразительный рост!, которое повышает его множитель урона на <font color=\"gold\">131.25%(8ур) / 150%(10ур) / 187.5%(15ур)</font>, крит. урон на <font color=\"gold\">21.88%(8ур) / 25%(10ур) / 31.25%(15ур)</font>, а также продвигает действие Счетовода вперёд на 50%, когда противник со статусом Справка о задолженности получает урон от базовой атаки, навыка или сверхспособности союзника. После 2 атак Счетовод возвращается из состояния Поразительный рост!</p>', 'топаз ult.png', '<h3>Рынок свинок?!</h3>\r\n<p>В начале боя призывает Счетовода. Вначале скорость Счетовода составляет 80 ед. Во время своего действия он выполняет бонус-атаку, которая наносит противнику со статусом Справка о задолженности огненный урон, равный <font color=\"gold\">131.25%(8ур) / 150%(10ур) / 187.5%(15ур)</font> от силы атаки Топаз.\r\nКогда противник со статусом Справка о задолженности получает бонус-атаку союзника, действие Счетовода продвигается вперёд на 50%. Продвижение действия не может сработать во время хода Счетовода.\r\nЕсли Топаз становится неспособна сражаться, Счетовод исчезает.</p>', 'топаз talant.png', '<h3>Дотация</h3>\r\n<p>Усиление\r\nТопаз призывает Счетовода, который может автоматически находить обычные сундуки и свинок-копилок в определённом радиусе.\r\nИспользование техники восстанавливает 60 ед. энергии Топаз в следующем бою после первой атаки Счетовода.\r\nПосле использования техники и победы над противником в открытом мире, если Счетовод остаётся в отряде, то при получении кредитов отряд дополнительно получает небольшое количество кредитов. За один земной день можно получить до 10000 кредитов.\r\nПосле использования техники и победы над противником в Виртуальной вселенной отряд дополнительно получает небольшое количество космических фрагментов и имеет небольшой шанс получить 1 случайную диковину.</p>', 'топаз tech.png'),
(3, 'Деятельница искусства, живущая на Лофу. Иными словами, уличная артистка. Когда она не озабочена поиском пропитания и крова, стремится к новой жизни на Лофу.', '<h3>A2 - Высокий шест</h3>\r\n<p>Базовые атаки имеют базовый шанс 80% наложить на противника статус Горение, сходный с описанным в навыке персонажа.</p>', 'гуйнайфэнь trace ability1.png', '<h3>A4 - Обруч с лезвиями</h3>\r\n<p>В начале боя действие Гуйнайфэнь продвигается вперёд на <font color=\"gold\">25%</font>.</p>', 'гуйнайфэнь trace ability2.png', '<h3>A6 - Ходьба по ножам</h3>\r\n<p>Наносимый противникам со статусом Горение урон повышается на <font color=\"gold\">20%</font>.</p>', 'гуйнайфэнь trace ability3.png', '<h3>Стоячие овации</h3> <p>Наносит выбранному противнику огненный урон, равный <font color=\"gold\">90%(5ур) / 100%(6ур) / 130%(9ур)</font> от силы атаки Гуйнайфэнь.</p>', 'гуйнайфэнь basic atk.png', '<h3>Горящее приветствие</h3>\r\n<p>Наносит выбранному противнику огненный урон, равный <font color=\"gold\">105%(8ур) / 120%(10ур) / 150%(15ур)</font> от силы атаки Гуйнайфэнь, и наносит соседним целям огненный урон, равный <font color=\"gold\">35%(8ур) / 40%(10ур) / 50%(15ур)</font> от её силы атаки, а также имеет базовый шанс 100% наложить на них статус Горение. Противник со статусом Горение получает в начале каждого хода периодический огненный урон, равный <font color=\"gold\">167.84%(8ур) / 218.21%(10ур) / 272.77%(15ур)</font> от силы атаки Гуйнайфэнь, в течение 2 ходов.</p>', 'гуйнайфэнь skill.png', '<h3>Подходи, соберём народ!</h3>\r\n<p>Наносит всем противникам огненный урон, равный <font color=\"gold\">108%(8ур) / 120%(10ур) / 144%(15ур)</font> от силы атаки Гуйнайфэнь. Если цель уже имеет статус Горение, то этот статус немедленно наносит урон, равный <font color=\"gold\">87%(8ур) / 92%(10ур) / 102%(15ур)</font> от своего изначального урона.</p>', 'гуйнайфэнь ult.png', '<h3>Народная поддержка честного артиста</h3>\r\n<p>Когда Гуйнайфэнь находится на поле боя и после того, как имеющийся у противника статус Горение наносит урон, появляется базовый шанс 100% наложить на него статус Огненный поцелуй. Получаемый противником со статусом Огненный поцелуй урон повышается на <font color=\"gold\">6.25%(8ур) / 7%(10ур) / 8.5%(15ур)</font> на 3 хода. Этот эффект может складываться до 3 раз.</p>', 'гуйнайфэнь talant.png', '<h3>Представление акробатических умений</h3>\r\n<p>Немедленно атакует противника и после начала боя наносит урон 4 раза, каждый раз нанося случайному противнику огненный урон, равный <font color=\"gold\">50%</font> от силы атаки Гуйнайфэнь, и имея базовый шанс 100% наложить на него статус Огненный поцелуй.</p>', 'гуйнайфэнь tech.png');

-- --------------------------------------------------------

--
-- Структура таблицы `char_eidolons`
--

CREATE TABLE `char_eidolons` (
  `id_char_eid` int(11) NOT NULL,
  `eid1` text NOT NULL,
  `eid1_img` varchar(255) NOT NULL,
  `eid2` text NOT NULL,
  `eid2_img` varchar(255) NOT NULL,
  `eid3` text NOT NULL,
  `eid3_img` varchar(255) NOT NULL,
  `eid4` text NOT NULL,
  `eid4_img` varchar(255) NOT NULL,
  `eid5` text NOT NULL,
  `eid5_img` varchar(255) NOT NULL,
  `eid6` text NOT NULL,
  `eid6_img` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `char_eidolons`
--

INSERT INTO `char_eidolons` (`id_char_eid`, `eid1`, `eid1_img`, `eid2`, `eid2_img`, `eid3`, `eid3_img`, `eid4`, `eid4_img`, `eid5`, `eid5_img`, `eid6`, `eid6_img`) VALUES
(1, '<h3>1 - Лунная атака ворот Тяньгуань</h3>\n<p>Использование сверхспособности или усиленного навыка повышает крит. урон Цзинлю на <font color=\"gold\">24%</font> на 1 ход(а). Если атакован только один противник, то он также получает ледяной урон, равный <font color=\"gold\">100%</font> от силы атаки Цзинлю.</p>', 'цзинлю eid1.png', '<h3>2 - Тень новолуния затмевает Северный ковш</h3>\n<p>Использование сверхспособности повышает урон следующего усиленного навыка на <font color=\"gold\">80%</font>.</p>', 'цзинлю eid2.png', '<h3>3 - Пытливый взгляд полумесяца</h3>\n<p>Уровень сверхспособности повышается на 2, максимальный уровень - 15. Уровень таланта повышается на 2, максимальный уровень - 15.</p>', 'цзинлю eid3.png', '<h3>4 - Поднятый ночной фонарь</h3>\n<p>В состоянии Спектральной трансмиграции сила атаки, полученная от потребления HP союзников, дополнительно повышается на <font color=\"gold\">90%</font> от общего количества HP, израсходованного всем отрядом. Сила атаки может повышаться таким образом до макс. <font color=\"gold\">30%</font>.</p>', 'цзинлю eid4.png', '<h3>5 - Тьма поглощает Небесную Медведицу</h3>\n<p>Уровень навыка повышается на 2, максимальный уровень - 15. Уровень базовой атаки повышается на 1, максимальный уровень - 10.</p>', 'цзинлю eid5.png', '<h3>6 - Затмение превращается в пустоту</h3>\n<p>Когда Цзинлю входит в состояние Спектральная трансмиграция, макс. ур. статуса Сизигия увеличивается, а сама Цзинлю дополнительно получает 1 ур. этого статуса. Также состояние Спектральная трансмиграция повышает крит. урон на <font color=\"gold\">50%</font>.</p>', 'цзинлю eid6.png'),
(2, '<h3>1 - Рынок будущего</h3>\r\n<p>Когда противник со статусом Справка о задолженности получает бонус-атаку, он также получает статус Привести в исполнение. Этот эффект может сработать только 1 раз за атаку.\r\nСтатус Привести в исполнение повышает получаемый противником крит. урон от бонус-атак на <font color=\"gold\">25%</font>. Этот эффект может складываться до 2 раз. Если статус Справка о задолженности снимается, то статус Привести в исполнение также снимается.</p>', 'топаз eid1.png', '<h3>2 - Дружественное приобретение</h3>\r\n<p>После того, как Счетовод выполняет действие и атаку, Топаз восстанавливает <font color=\"gold\">5 ед.</font> энергии.</p>', 'топаз eid2.png', '<h3>3 - Хватай крупное, отпускай мелкое</h3>\r\n<p>Уровень навыка повышается на 2, максимальный уровень - 15. Уровень базовой атаки повышается на 1, максимальный уровень - 10.</p>', 'топаз eid3.png', '<h3>4 - Гибкое управление</h3>\r\n<p>Когда начинается ход Счетовода, действие Топаз продвигается вперёд на <font color=\"gold\">20%</font>.</p>', 'топаз eid4.png', '<h3>5 - Инфляция спроса</h3>\r\n<p>Уровень сверхспособности повышается на 2, максимальный уровень - 15. Уровень таланта повышается на 2, максимальный уровень - 15.</p>', 'топаз eid5.png', '<h3>6 - Механизмы поощрения</h3>\r\n<p>Количество атак Счетовода в состоянии Поразительный рост! увеличивается на 1, а пробитие огненного сопротивления его атак повышается на <font color=\"gold\">10%</font>.</p>', 'топаз eid6.png'),
(3, '<h3>1 - Поедание лапши вверх ногами</h3>\r\n<p>Использование навыка имеет базовый шанс 100% понизить сопротивление эффектам атакованного противника на <font color=\"gold\">10%</font>. Этот эффект длится 2 хода.</p>', 'гуйнайфэнь eid1.png', '<h3>2 - Свист во время чистки зубов</h3>\r\n<p>Если противник имеет статус Горение, базовая атака и навык Гуйнайфэнь повышают множитель урона имеющегося статуса на <font color=\"gold\">40%</font>.</p>', 'гуйнайфэнь eid2.png', '<h3>3 - Раскалывание булыжника на груди</h3>\r\n<p>Уровень навыка повышается на 2, максимальный уровень - 15. Уровень базовой атаки повышается на 1, максимальный уровень - 10.</p>', 'гуйнайфэнь eid3.png', '<h3>4 - Упор копья о шею</h3>\r\n<p>Гуйнайфэнь восстанавливает <font color=\"gold\">2 ед.</font> энергии каждый раз, когда наложенный ею статус Горение наносит урон.</p>', 'гуйнайфэнь eid4.png', '<h3>5 - Глотание меча</h3>\r\n<p>Уровень сверхспособности повышается на 2, максимальный уровень - 15. Уровень таланта повышается на 2, максимальный уровень - 15.</p>', 'гуйнайфэнь eid5.png', '<h3>6 - Ловля пуль</h3>\r\n<p>Увеличивает макс. уровень складывания статуса Огненный поцелуй на 1.</p>', 'гуйнайфэнь eid6.png');

-- --------------------------------------------------------

--
-- Структура таблицы `char_stat`
--

CREATE TABLE `char_stat` (
  `id_char` int(11) NOT NULL,
  `hp` int(11) NOT NULL,
  `atk` int(11) NOT NULL,
  `def` int(11) NOT NULL,
  `spd` int(11) NOT NULL,
  `max_energy` int(11) NOT NULL,
  `trace1_stat` varchar(255) NOT NULL,
  `trace1_value` varchar(255) NOT NULL,
  `trace1_stat_img` varchar(255) NOT NULL,
  `trace2_stat` varchar(255) NOT NULL,
  `trace2_value` varchar(255) NOT NULL,
  `trace2_stat_img` varchar(255) NOT NULL,
  `trace3_stat` varchar(255) NOT NULL,
  `trace3_value` varchar(255) NOT NULL,
  `trace3_stat_img` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `char_stat`
--

INSERT INTO `char_stat` (`id_char`, `hp`, `atk`, `def`, `spd`, `max_energy`, `trace1_stat`, `trace1_value`, `trace1_stat_img`, `trace2_stat`, `trace2_value`, `trace2_stat_img`, `trace3_stat`, `trace3_value`, `trace3_stat_img`) VALUES
(1, 1435, 679, 485, 96, 140, 'скорость', '+9', 'spd.png', 'крит урон', '+37.3%', 'c_dmg.png', 'здоровье', '+10%', 'hp.png'),
(2, 931, 620, 412, 110, 130, 'к. шанс', '+12%', 'c_rate.png', 'огн. урон', '+22.4%', 'fire_dmg.png', 'здоровье', '+10%', 'hp.png'),
(3, 882, 582, 441, 106, 120, 'пробитие', '+24%', 'break.png', 'огн. урон', '+22.4%', 'fire_dmg.png', 'налож. эффекта', '+10%', 'ef hit rate.png');

-- --------------------------------------------------------

--
-- Структура таблицы `comments`
--

CREATE TABLE `comments` (
  `id` int(11) NOT NULL,
  `login_name` varchar(255) NOT NULL,
  `comment` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `comments`
--

INSERT INTO `comments` (`id`, `login_name`, `comment`) VALUES
(1, 'qwe', 'zxc'),
(5, 'qwe', 'ffffddfdfff');

-- --------------------------------------------------------

--
-- Структура таблицы `curios`
--

CREATE TABLE `curios` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `img` varchar(255) NOT NULL,
  `ability` text NOT NULL,
  `history` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `curios`
--

INSERT INTO `curios` (`id`, `name`, `img`, `ability`, `history`) VALUES
(1, 'Клей удачи', 'клей.png', 'При выборе благословения после победы в бою появится благословение 3★. После 1 раза срабатывания эффекта диковина повреждается.', 'Является ли удача способностью? Может быть. Можно ли изменить удачу? Герта верит, что это возможно. Она изобрела Клей удачи. Просто нанесите его на веки, и ваша удача увеличится на целых 24 часа. Многие на космической станции «Герта» были в восторге от возможности опробовать это изобретение. Они все провели прекрасный день, который напомнил им о возможности жить обычной жизнью в неспокойном мире.');

-- --------------------------------------------------------

--
-- Структура таблицы `element`
--

CREATE TABLE `element` (
  `id_elem` int(11) NOT NULL,
  `name_element` varchar(255) NOT NULL,
  `img_element` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `element`
--

INSERT INTO `element` (`id_elem`, `name_element`, `img_element`) VALUES
(1, 'Physical', 'Physical.png'),
(2, 'Ice', 'Ice.png'),
(3, 'Fire', 'Fire.png'),
(4, 'Lightning', 'Lightning.png'),
(5, 'Wind', 'Wind.png'),
(6, 'Quantum', 'Quantum.png'),
(7, 'Imaginary', 'Imaginary.png');

-- --------------------------------------------------------

--
-- Структура таблицы `light_cones`
--

CREATE TABLE `light_cones` (
  `id` int(11) NOT NULL,
  `name_cone` varchar(255) NOT NULL,
  `cone_img` varchar(255) NOT NULL,
  `rare` int(11) NOT NULL,
  `path` varchar(10) NOT NULL,
  `img_path` varchar(255) NOT NULL,
  `hp` int(11) NOT NULL,
  `atk` int(11) NOT NULL,
  `def` int(11) NOT NULL,
  `ability` text NOT NULL,
  `description` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `light_cones`
--

INSERT INTO `light_cones` (`id`, `name_cone`, `cone_img`, `rare`, `path`, `img_path`, `hp`, `atk`, `def`, `ability`, `description`) VALUES
(1, 'Отныне я сама буду мечом', 'I shall be.png', 5, 'Разрушение', 'Разрушение.png', 1164, 582, 396, 'Крит. урон владельца повышается на <font color=\"gold\">20-32%</font>. Когда союзник получает атаку или теряет HP, владелец получает 1 уровень статуса Лунное затмение, до макс. 3 уровня. Каждый уровень этого статуса повышает урон следующей атаки владельца на <font color=\"gold\">14-24%</font>. Достижение 3 уровня статуса Лунное затмение позволяет проигнорировать <font color=\"gold\">12-20%</font> защиты противника. Этот эффект снимается после выполнения владельцем атаки.', 'Разбитое лезвие погружается в пробирающий до костей холод. От металлического оружия нет никакой пользы, ведь с первого взгляда видно на что оно способно.<br><i>- Какая мне польза от меча?</i><br>В её сердце нет места любви, а взгляд её пуст.<br><i>- Отныне я сама буду мечом.</i><br>Единственный путь выйти за так называемые пределы и свершить неслыханные прорывы - стать топливом для своего же пламени.'),
(2, 'Тревога и блаженство', 'worrysome.png', 5, 'Охота', 'Охота.png', 1058, 582, 463, 'Крит. шанс владельца повышается на <font color=\"gold\">18-30%</font>, а урон от бонус-атаки - на <font color=\"gold\">30-50%</font>. После выполнения бонус-атаки накладывает на цель статус Приручение, который может складываться до 2 раз. Когда союзник поражает противника со статусом Приручение, каждый уровень этого статуса повышает наносимый крит. урон на <font color=\"gold\">12-20%</font>.', 'Для специалиста Корпорации испытывать стресс недопустимо. Даже усталый и подавленный, он должен идти навстречу трудностям с высоко поднятой головой.<br>Ну только если... его не придавило «ими».<br><br>  <i>- Спокойно-спокойно! У меня всего две руки!</i><br>Девушка только что вернулась домой после долгого рабочего дня и оказалась буквально завалена мохнатыми пушистиками. Возможно, они не совсем понимают её слова, прижимаясь своими круглыми головками к её ладоням. Она гладит мягкую шерсть, и на смену усталости приходит чувство тепла и уюта.'),
(3, 'Во имя мира', 'In the Name.png', 5, 'Небытие', 'Небытие.png', 1058, 582, 463, '<h3>Наследник</h3>\r\n<p>Урон владельца, наносимый противникам с ослаблениями, повышается на <font color=\"gold\">24-40%</font>. Когда владелец использует навык, шанс попадания эффектов этой атаки повышается на <font color=\"gold\">18-30%</font>, а сила атаки - на <font color=\"gold\">24-40%</font>.</p>', '<p><i>- Вельт?..<br>- Это... отличное имя, верно?<br>- Тогда...<br>- Отныне ты Вельт.<br>- Это ядро Херршера... и миссия по защите мира...<br>- Я оставляю их тебе, Вельт.</i></p>');

-- --------------------------------------------------------

--
-- Структура таблицы `news_card`
--

CREATE TABLE `news_card` (
  `id` int(11) NOT NULL,
  `short_desc` varchar(255) NOT NULL,
  `img` varchar(255) NOT NULL,
  `href` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `news_card`
--

INSERT INTO `news_card` (`id`, `short_desc`, `img`, `href`) VALUES
(1, 'Встречайте страшего сотрудника отдела стратегических инвестиций КММ - Топаз и Счетовод', 'Топаз.png', 'character.php?id=2'),
(2, 'Легендарная героиня из Заоблочного квинтета, удостоенная титула Непостижимая зарница - Цзинлю', 'Цзинлю.png', 'character.php?id=1'),
(3, 'Знакомство с новым персонажем версии 1.4 - пылкая и жизнерадостная уличная артистка Гуйнайфэнь', 'Гуйнайфэнь.png', 'character.php?id=3'),
(4, 'Новый световой конус - \"Тревога и блаженство\"', 'worrysome.png', 'lightcone.php?id=2'),
(5, 'Обзор светового конуса - \"Отныне я буду мечом\"', 'I shall be.png', 'lightcone.php?id=1'),
(6, 'Встречайте страшего сотрудника отдела стратегических инвестиций КММ - Топаз и Счетовод', 'Топаз.png', 'character.php?id=2');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `login` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `login`, `password`, `email`) VALUES
(1, 'admin', 'admin', 'admin@admin.ru'),
(2, 'qwe', 'qwe', 'qwe@asd');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `blessings`
--
ALTER TABLE `blessings`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `characters`
--
ALTER TABLE `characters`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `char_desc`
--
ALTER TABLE `char_desc`
  ADD PRIMARY KEY (`id_char_desc`);

--
-- Индексы таблицы `char_eidolons`
--
ALTER TABLE `char_eidolons`
  ADD PRIMARY KEY (`id_char_eid`);

--
-- Индексы таблицы `char_stat`
--
ALTER TABLE `char_stat`
  ADD PRIMARY KEY (`id_char`);

--
-- Индексы таблицы `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `curios`
--
ALTER TABLE `curios`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `element`
--
ALTER TABLE `element`
  ADD PRIMARY KEY (`id_elem`);

--
-- Индексы таблицы `light_cones`
--
ALTER TABLE `light_cones`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `news_card`
--
ALTER TABLE `news_card`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `blessings`
--
ALTER TABLE `blessings`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT для таблицы `characters`
--
ALTER TABLE `characters`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `char_desc`
--
ALTER TABLE `char_desc`
  MODIFY `id_char_desc` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `char_eidolons`
--
ALTER TABLE `char_eidolons`
  MODIFY `id_char_eid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `char_stat`
--
ALTER TABLE `char_stat`
  MODIFY `id_char` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `comments`
--
ALTER TABLE `comments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `curios`
--
ALTER TABLE `curios`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `element`
--
ALTER TABLE `element`
  MODIFY `id_elem` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT для таблицы `light_cones`
--
ALTER TABLE `light_cones`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `news_card`
--
ALTER TABLE `news_card`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
